blog/2019/03/static-site-generation/index.org
#+TITLE: (New) Static Site Generation
#+DESCRIPTION: Migration from Hugo to org-mode, some scripts, and pandoc
#+TAGS: Emacs
#+TAGS: Org-mode
#+TAGS: GNU/Linux
#+TAGS: Bash
#+TAGS: Make
#+TAGS: Pandoc
#+DATE: 2019-03-03
#+SLUG: static-site-generation
#+LINK: blog-git https://git.devnulllabs.io/blog.kennyballou.com.git/
#+LINK: golang https://golang.org
#+LINK: hugo https://gohugo.io/
#+LINK: wiki-markdown https://en.wikipedia.org/wiki/Markdown
#+LINK: org-mode https://org-mode.org
#+LINK: org-manual https://orgmode.org/manual/
#+LINK: org-mode-publish https://orgmode.org/manual/Publishing.html#Publishing
#+LINK: wiki-rst https://en.wikipedia.org/wiki/ReStructuredText
#+LINK: justin-abrah-org-publish https://justin.abrah.ms/emacs/orgmode_static_site_generator.html
#+LINK: panchekha-org-publish https://pavpanchekha.com/blog/org-mode-publish.html
#+LINK: evenchick-org-publish https://www.evenchick.com/blog/blogging-with-org-mode.html
#+LINK: ogbe-org-publish https://ogbe.net/blog/blogging_with_org.html
#+LINK: pandoc https://pandoc.org
#+LINK: gnu-gpl https://www.gnu.org/licenses/gpl-3.0.html

#+BEGIN_PREVIEW
For a few years, I've been using [[hugo][Hugo]] for blog generation.  Recently,
I've decided I wanted to take static site generation into a different
direction.  Specifically, I wanted to use a different source markup and I
wanted to write my own tool set for generating the actual HTML.
#+END_PREVIEW

We'll walk through the motivation of changing the content into a different
format and changing the generation process into a completely custom set of
scripts.

** Motivation
:PROPERTIES:
:ID:       033a8bdf-c442-4f06-9eca-a3691780cc1e
:END:

When I first set down to build a blog 5 years ago, I had a pretty basic set of
requirements.

- Lightweight

- Native Markdown Support

- Minimal Dependencies

[[hugo][Hugo]] met all of these requirements quite well.  The templating engine
is fairly simplistic; It supports Markdown; It's a written in [[golang][Go]],
therefore, only the built artifact is necessary for site generation.

If it fits so well, why change?

It worked well for what I was asking, however, as I wrote more and time went
on, the features of [[hugo][Hugo]] became more and more complex and created a
mismatch of how I wanted to express the text in the markup.  I've felt this was
going in a direction I did not need nor wanted.  More specifically, the issues
start surfacing more in the [[wiki-markdown][Markdown]] side.
[[wiki-markdown][Markdown]] simply lacks some features in its markup that is
corrected by blocks of HTML inline and other hacks that are standard in only
some specific "flavor" or translator implementation.  [[hugo][Hugo]] attempts
to patch this over with its implementation of ~shortcode templates~, however,
these still felt unnatural.

The final nail was discovering [[org-mode][Org-mode]].  I liked the weight of
[[wiki-markdown][Markdown]], but I didn't like its lack of features when
needed.  I liked [[wiki-rst][rStructured Text]], however, I felt it was always
too heavy for the documents I was working on.

In finally giving Emacs a full try (another blog post), I discovered
[[org-mode][Org-mode]].  It was the exact middle weight I was looking for
between [[wiki-markdown][Markdown]] and [[wiki-rst][reST]].

Thus, I was in search of a new tool for generating static HTML from a set of
source files written in [[org-mode][Org-mode]].

[[org-mode][Org-mode]] (within Emacs) has a native publish mode, and I had
discovered [[justin-abrah-org-publish][several]]
[[panchekha-org-publish][posts]] on how [[ogbe-org-publish][people]] are doing
[[evenchick-org-publish][exactly]] this.  However,
[[org-mode-publish][Org-publish]] isn't exactly what I was looking for.

Therefore, let's revise the current list of requirements:

- Makefile driven

- Does not require Emacs to generate

That is, I wanted a ~Makefile~ that could generate the site contents.
Furthermore, and no less importantly, I wanted the ~Makefile~ to not include
lines like ~Emacs --quick --batch ...~.  This obviously creates a bit of a
challenge since [[org-mode][Org-mode]] is an Emacs mode.

I decided I could probably generate the content myself with a few scripts and
invocations to [[pandoc][Pandoc]].

** High-Level Implementation
:PROPERTIES:
:ID:       4347513c-519e-4432-bdc5-f797c58fbe51
:END:

The core of the implementation of the new site generation is blog posts written
in [[org-mode][Org-mode]], processed by several shell scripts, using
[[pandoc][Pandoc]] to perform the translation from raw [[org-mode][Org-mode]]
markup to HTML, all of which is orchestrated by a ~Makefile~.

I'm not going extol [[org-mode][Org-mode]]'s capabilities in this post.
There's plenty of resources on it already, no greater authority than the
[[org-manual][Org-mode Manual]] itself.

There is, in fact, some limitations of [[org-mode][Org-mode]] due to the
choices of not allowing the generation to include ~Emacs~ itself.

Along the tour of the implementation, it's important to note a guiding
principle in the conversion was not breaking existing links.  That is, I was
and am satisfied with the folders and slug usage for posts and I didn't want
the new version to break existing links.

** Detailed Implementation
:PROPERTIES:
:ID:       3f40dad3-6b20-43ea-adaf-9e993a588f5a
:END:

The easy part is generating each post.  This is simply an ~index.html~ in the
correct folder.  The majority of the complexities stem from the summaries and
main ~index~ page.

