blog/2019/03/static-site-generation/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-28 Mon 17:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>(New) Static Site Generation</title>
<meta name="author" content="kb" />
<meta name="description" content="Migration from Hugo to org-mode, some scripts, and pandoc" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">

<meta name="author" content="Kenny Ballou">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<title>~kb</title>

<link rel="canonical" href="/" />
<link href="/index.xml" rel="alternate" type="application/rss+xml"
      title="~kb/blog" />

<link rel="stylesheet" href="/css/simple.css" />
<link rel="stylesheet" href="/css/simple.add.css" />
<link rel="stylesheet" href="/css/katex.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://kennyballou.com/blog"> UP </a>
 |
 <a accesskey="H" href="https://kennyballou.com/"> HOME </a>
</div><header id="" class="status">
<nav>
  <a href="/">
    <i class="fade fas fa-home"></i>
  </a>
  <a href="/about.html">
    <i class="fade fas fa-user-circle"></i>
  </a>
  <a href="https://git.sr.ht/~kennyballou/"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade far fa-circle fa-1x"></i>
  </a>
  <a href="https://github.com/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-github fa-1x"></i>
  </a>
  <a href="https://bitbucket.org/kballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-bitbucket fa-1x"></i>
  </a>
  <a href="https://orcid.org/0000-0002-6032-474X"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-orcid"></i>
  </a>
  <a href="https://linkedin.com/in/kennyballou"
     target="_blank"
     rel="noopener noreferrer">
    <i class="fade fab fa-linkedin-in fa-1x"></i>
  </a>
  <a href="/support.html">
    <i class="fade fas fa-heart fa-1x"></i>
  </a>
  <a href="/cv.pdf"
     target="_blank">
    <i class="fade far fa-file-pdf"></i>
  </a>
  <a href="/B74CC4B41148C3DB364BC21182D94B35744E1B34.asc"
     target="_blank">
    <i class="fade fas fa-key"></i>
  </a>
  <a href="/index.xml" rel="alternate"
     type="application/rss+xml">
    <i class="fade fas fa-rss fa-1x"></i>
  </a>
</nav>
</header>
<div id="main" class="content">
<h1 class="title">(New) Static Site Generation</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2cb3756">Motivation</a></li>
<li><a href="#org3a0857f">High-Level Implementation</a></li>
<li><a href="#org14ae35e">Detailed Implementation</a>
<ul>
<li><a href="#org4b71632">Post Content Generation</a></li>
<li><a href="#org8142fcf">Summary Page Generation</a></li>
<li><a href="#org94b58ce">RSS/XML Generation</a></li>
</ul>
</li>
<li><a href="#org52d9de0">Future Work</a></li>
<li><a href="#org0b51d3c">Parting Thoughts</a></li>
</ul>
</div>
</div>
<div class="PREVIEW" id="org63379f8">
<p>
For a few years, I've been using <a href="https://gohugo.io/">Hugo</a> for blog generation.  Recently,
I've decided I wanted to take static site generation into a different
direction.  Specifically, I wanted to use a different source markup and I
wanted to write my own tool set for generating the actual HTML.
</p>

</div>

<p>
We'll walk through the motivation of changing the content into a different
format and changing the generation process into a completely custom set of
scripts.
</p>

<div id="outline-container-org2cb3756" class="outline-2">
<h2 id="org2cb3756">Motivation</h2>
<div class="outline-text-2" id="text-org2cb3756">
<p>
When I first set down to build a blog 5 years ago, I had a pretty basic set of
requirements.
</p>

<ul class="org-ul">
<li>Lightweight</li>

<li>Native Markdown Support</li>

<li>Minimal Dependencies</li>
</ul>

<p>
<a href="https://gohugo.io/">Hugo</a> met all of these requirements quite well.  The templating engine
is fairly simplistic; It supports Markdown; It's a written in <a href="https://golang.org">Go</a>,
therefore, only the built artifact is necessary for site generation.
</p>

<p>
If it fits so well, why change?
</p>

<p>
It worked well for what I was asking, however, as I wrote more and time went
on, the features of <a href="https://gohugo.io/">Hugo</a> became more and more complex and created a
mismatch of how I wanted to express the text in the markup.  I've felt this was
going in a direction I did not need nor wanted.  More specifically, the issues
start surfacing more in the <a href="https://en.wikipedia.org/wiki/Markdown">Markdown</a> side.
<a href="https://en.wikipedia.org/wiki/Markdown">Markdown</a> simply lacks some features in its markup that is
corrected by blocks of HTML inline and other hacks that are standard in only
some specific "flavor" or translator implementation.  <a href="https://gohugo.io/">Hugo</a> attempts
to patch this over with its implementation of <code>shortcode templates</code>, however,
these still felt unnatural.
</p>

<p>
The final nail was discovering <a href="https://org-mode.org">Org-mode</a>.  I liked the weight of
<a href="https://en.wikipedia.org/wiki/Markdown">Markdown</a>, but I didn't like its lack of features when
needed.  I liked <a href="https://en.wikipedia.org/wiki/ReStructuredText">rStructured Text</a>, however, I felt it was always
too heavy for the documents I was working on.
</p>

<p>
In finally giving Emacs a full try (another blog post), I discovered
<a href="https://org-mode.org">Org-mode</a>.  It was the exact middle weight I was looking for
between <a href="https://en.wikipedia.org/wiki/Markdown">Markdown</a> and <a href="https://en.wikipedia.org/wiki/ReStructuredText">reST</a>.
</p>

<p>
Thus, I was in search of a new tool for generating static HTML from a set of
source files written in <a href="https://org-mode.org">Org-mode</a>.
</p>

<p>
<a href="https://org-mode.org">Org-mode</a> (within Emacs) has a native publish mode, and I had
discovered <a href="https://justin.abrah.ms/emacs/orgmode_static_site_generator.html">several</a>
<a href="https://pavpanchekha.com/blog/org-mode-publish.html">posts</a> on how <a href="https://ogbe.net/blog/blogging_with_org.html">people</a> are doing
<a href="https://www.evenchick.com/blog/blogging-with-org-mode.html">exactly</a> this.  However,
<a href="https://orgmode.org/manual/Publishing.html#Publishing">Org-publish</a> isn't exactly what I was looking for.
</p>

<p>
Therefore, let's revise the current list of requirements:
</p>

<ul class="org-ul">
<li>Makefile driven</li>

<li>Does not require Emacs to generate</li>
</ul>

<p>
That is, I wanted a <code>Makefile</code> that could generate the site contents.
Furthermore, and no less importantly, I wanted the <code>Makefile</code> to not include
lines like <code>Emacs --quick --batch ...</code>.  This obviously creates a bit of a
challenge since <a href="https://org-mode.org">Org-mode</a> is an Emacs mode.
</p>

<p>
I decided I could probably generate the content myself with a few scripts and
invocations to <a href="https://pandoc.org">Pandoc</a>.
</p>
</div>
</div>

<div id="outline-container-org3a0857f" class="outline-2">
<h2 id="org3a0857f">High-Level Implementation</h2>
<div class="outline-text-2" id="text-org3a0857f">
<p>
The core of the implementation of the new site generation is blog posts written
in <a href="https://org-mode.org">Org-mode</a>, processed by several shell scripts, using
<a href="https://pandoc.org">Pandoc</a> to perform the translation from raw <a href="https://org-mode.org">Org-mode</a>
markup to HTML, all of which is orchestrated by a <code>Makefile</code>.
</p>

<p>
I'm not going extol <a href="https://org-mode.org">Org-mode</a>'s capabilities in this post.
There's plenty of resources on it already, no greater authority than the
<a href="https://orgmode.org/manual/">Org-mode Manual</a> itself.
</p>

<p>
There is, in fact, some limitations of <a href="https://org-mode.org">Org-mode</a> due to the
choices of not allowing the generation to include <code>Emacs</code> itself.
</p>

<p>
Along the tour of the implementation, it's important to note a guiding
principle in the conversion was not breaking existing links.  That is, I was
and am satisfied with the folders and slug usage for posts and I didn't want
the new version to break existing links.
</p>
</div>
</div>

<div id="outline-container-org14ae35e" class="outline-2">
<h2 id="org14ae35e">Detailed Implementation</h2>
<div class="outline-text-2" id="text-org14ae35e">
<p>
The easy part is generating each post.  This is simply an <code>index.html</code> in the
correct folder.  The majority of the complexities stem from the summaries and
main <code>index</code> page.
</p>
</div>
