blog/2019/03/static-site-generation/index.org
*** Post Content Generation
:PROPERTIES:
:ID:       fd1f96fe-10e0-4b75-b955-8dcdbf5fc265
:END:

To generate a blog post's ~index.html~ page, we consider the following ~make~
target:

#+BEGIN_SRC makefile
blog_dir = $(shell $(SCRIPTS_DIR)/org-get-slug.sh $(1))
TEMPLATE_FILES:=$(wildcard templates/*.html)

define BLOG_BUILD_DEF
$(BUILD_DIR)$(call blog_dir,$T):
	mkdir -p $$@
$(BUILD_DIR)$(call blog_dir,$T)/index.html: $T \
											$(TEMPLATE_FILES) \
											Makefile \
										  | $(BUILD_DIR)$(call blog_dir,$T)
	$(SCRIPTS_DIR)/generate_post_html.sh $$< > $$@
endef

$(foreach T,$(POSTS_ORG_INPUT),$(eval $(BLOG_BUILD_DEF)))
#+END_SRC

This definition is fairly opaque now.  However, the definition will expand for
each post when the ~foreach~ macro expands.  For example, when run, the
following targets will be defined for this post:

#+BEGIN_SRC makefile
$(BUILD_DIR)/blog/2019/03/static-site-generation:
	mkdir -p $@
$(BUILD_DIR)/blog/2019/03/static-site-generation/index.html: posts/static-site-generation.org \
															 $(TEMPLATE_FILES) \
															 Makefile \
														   | $(BUILD_DIR)/blog/2019/03/static-site-generation
	$(SCRIPTS_DIR)/generate_post.html $< > $@
#+END_SRC

This will create the correct directory for each post, e.g.,
~/blog/2019/03/static-site-generation~, and place the translated HTML into this
directory as ~index.html~.

#+BEGIN_QUOTE
Note: it doesn't actually translate to ~$(TEMPLATE_FILES)~.  During the
expansion of the definition, the variable ~$(TEMPLATE_FILES)~ is similarly
expanded.  This is acceptable, however, since it's a static list of files and
has no bearing on which post's target is being expanded.
#+END_QUOTE

The ~generate_post.sh~ script is fairly basic:

#+BEGIN_SRC bash
#!/usr/bin/env bash
# Generate HTML for blog post

ORGIN=${1}
PROJ_ROOT=$(git rev-parse --show-toplevel)
source ${PROJ_ROOT}/scripts/site-templates.sh
source ${PROJ_ROOT}/scripts/org-metadata.sh
DISPLAY_DATE=$(date -d ${DATE} +'%a %b %d, %Y')
SORT_DATE=$(date -d ${DATE} +'%Y	%m	%d	')

cat ${HTML_HEADER_FILE}
cat ${HTML_SUB_HEADER_FILE}
echo -n "<h1 class=\"title\">${TITLE}</h1>"
echo -n "<div class=\"post-meta\">"
echo -n '<ul class="tags"><li><i class="fa fa-tags"></i></li>'
echo -n "${TAGS}" | awk '{ printf "<li>%s</li>", $0}'
echo -n '</ul>'
echo -n "<h4>${DISPLAY_DATE}</h4></div>"
pandoc --from org \
       --to html \
       ${ORGIN}
cat ${HTML_FOOTER_FILE}

#+END_SRC

The ~org-metadata.sh~ script, reads the [[org-mode][Org-mode]] preamble, lines
starting with ~#+~, and puts them into different variables available for other
scripts.  For example, the ~TITLE~, ~DATE~, ~TAGS~ are pulled out and used to
generate the title section of each post.  Furthermore, some templates are
pulled in to generate the headers and footers of each page.  The templates are
written directly in HTML and really serve only to simplify each page with
otherwise largely duplicated content.

