blog/2019/03/static-site-generation/index.html

<div id="outline-container-org4b71632" class="outline-3">
<h3 id="org4b71632">Post Content Generation</h3>
<div class="outline-text-3" id="text-org4b71632">
<p>
To generate a blog post's <code>index.html</code> page, we consider the following <code>make</code>
target:
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="font-weight: bold; font-style: italic;">blog_dir</span> = $(<span style="font-weight: bold; font-style: italic;">shell</span> $(<span style="font-weight: bold; font-style: italic;">SCRIPTS_DIR</span>)/org-get-slug.sh $(<span style="font-weight: bold; font-style: italic;">1</span>))
<span style="font-weight: bold; font-style: italic;">TEMPLATE_FILES</span>:=$(<span style="font-weight: bold; font-style: italic;">wildcard</span> templates/*.html)

define BLOG_BUILD_DEF
<span style="font-weight: bold;">$(</span><span style="font-weight: bold; font-style: italic;">BUILD_DIR</span><span style="font-weight: bold;">)$(</span><span style="font-weight: bold; font-style: italic;">call</span><span style="font-weight: bold;"> blog_dir,$</span><span style="font-weight: bold; text-decoration: underline;">T</span><span style="font-weight: bold;">)</span>:
        mkdir -p $$@
<span style="font-weight: bold;">$(</span><span style="font-weight: bold; font-style: italic;">BUILD_DIR</span><span style="font-weight: bold;">)$(</span><span style="font-weight: bold; font-style: italic;">call</span><span style="font-weight: bold;"> blog_dir,$</span><span style="font-weight: bold; text-decoration: underline;">T</span><span style="font-weight: bold;">)/index.html</span>: $<span style="font-weight: bold; text-decoration: underline;">T</span> \
                                                                                        $(<span style="font-weight: bold; font-style: italic;">TEMPLATE_FILES</span>) \
                                                                                        Makefile \
                                                                                  | $(<span style="font-weight: bold; font-style: italic;">BUILD_DIR</span>)$(<span style="font-weight: bold; font-style: italic;">call</span> blog_dir,$<span style="font-weight: bold; text-decoration: underline;">T</span>)
        $(<span style="font-weight: bold; font-style: italic;">SCRIPTS_DIR</span>)/generate_post_html.sh $$&lt; &gt; $$@
endef

$(<span style="font-weight: bold; font-style: italic;">foreach</span> T,$(<span style="font-weight: bold; font-style: italic;">POSTS_ORG_INPUT</span>),$(<span style="font-weight: bold; font-style: italic;">eval</span> $(<span style="font-weight: bold; font-style: italic;">BLOG_BUILD_DEF</span>)))
</pre>
</div>

<p>
This definition is fairly opaque now.  However, the definition will expand for
each post when the <code>foreach</code> macro expands.  For example, when run, the
following targets will be defined for this post:
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="font-weight: bold;">$(</span><span style="font-weight: bold; font-style: italic;">BUILD_DIR</span><span style="font-weight: bold;">)/blog/2019/03/static-site-generation</span>:
        mkdir -p <span style="font-weight: bold;">$</span><span style="font-weight: bold; text-decoration: underline;">@</span>
<span style="font-weight: bold;">$(</span><span style="font-weight: bold; font-style: italic;">BUILD_DIR</span><span style="font-weight: bold;">)/blog/2019/03/static-site-generation/index.html</span>: posts/static-site-generation.org \
                                                                                                                         $(<span style="font-weight: bold; font-style: italic;">TEMPLATE_FILES</span>) \
                                                                                                                         Makefile \
                                                                                                                   | $(<span style="font-weight: bold; font-style: italic;">BUILD_DIR</span>)/blog/2019/03/static-site-generation
        $(<span style="font-weight: bold; font-style: italic;">SCRIPTS_DIR</span>)/generate_post.html $<span style="font-weight: bold; text-decoration: underline;">&lt;</span> &gt; <span style="font-weight: bold;">$</span><span style="font-weight: bold; text-decoration: underline;">@</span>
</pre>
</div>

<p>
This will create the correct directory for each post, e.g.,
<code>/blog/2019/03/static-site-generation</code>, and place the translated HTML into this
directory as <code>index.html</code>.
</p>

<blockquote>
<p>
Note: it doesn't actually translate to <code>$(TEMPLATE_FILES)</code>.  During the
expansion of the definition, the variable <code>$(TEMPLATE_FILES)</code> is similarly
expanded.  This is acceptable, however, since it's a static list of files and
has no bearing on which post's target is being expanded.
</p>
</blockquote>

<p>
The <code>generate_post.sh</code> script is fairly basic:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/</span><span style="font-weight: bold;">env</span><span style="font-weight: bold; font-style: italic;"> bash</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Generate HTML for blog post</span>

<span style="font-weight: bold; font-style: italic;">ORGIN</span>=${<span style="font-weight: bold; font-style: italic;">1</span>}
<span style="font-weight: bold; font-style: italic;">PROJ_ROOT</span>=$(git rev-parse --show-toplevel)
source ${<span style="font-weight: bold; font-style: italic;">PROJ_ROOT</span>}/scripts/site-templates.sh
source ${<span style="font-weight: bold; font-style: italic;">PROJ_ROOT</span>}/scripts/org-metadata.sh
<span style="font-weight: bold; font-style: italic;">DISPLAY_DATE</span>=$(date -d ${<span style="font-weight: bold; font-style: italic;">DATE</span>} +<span style="font-style: italic;">'%a %b %d, %Y'</span>)
<span style="font-weight: bold; font-style: italic;">SORT_DATE</span>=$(date -d ${<span style="font-weight: bold; font-style: italic;">DATE</span>} +<span style="font-style: italic;">'%Y        %m      %d      '</span>)

cat ${<span style="font-weight: bold; font-style: italic;">HTML_HEADER_FILE</span>}
cat ${<span style="font-weight: bold; font-style: italic;">HTML_SUB_HEADER_FILE</span>}
<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">"&lt;h1 class=\"title\"&gt;${TITLE}&lt;/h1&gt;"</span>
<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">"&lt;div class=\"post-meta\"&gt;"</span>
<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">'&lt;ul class="tags"&gt;&lt;li&gt;&lt;i class="fa fa-tags"&gt;&lt;/i&gt;&lt;/li&gt;'</span>
<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">"${TAGS}"</span> | awk <span style="font-style: italic;">'{ printf "&lt;li&gt;%s&lt;/li&gt;", $0}'</span>
<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">'&lt;/ul&gt;'</span>
<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">"&lt;h4&gt;${DISPLAY_DATE}&lt;/h4&gt;&lt;/div&gt;"</span>
pandoc --from org <span style="font-style: italic;">\</span>
       --to html <span style="font-style: italic;">\</span>
       ${<span style="font-weight: bold; font-style: italic;">ORGIN</span>}
cat ${<span style="font-weight: bold; font-style: italic;">HTML_FOOTER_FILE</span>}

</pre>
</div>

<p>
The <code>org-metadata.sh</code> script, reads the <a href="https://org-mode.org">Org-mode</a> preamble, lines
starting with <code>#+</code>, and puts them into different variables available for other
scripts.  For example, the <code>TITLE</code>, <code>DATE</code>, <code>TAGS</code> are pulled out and used to
generate the title section of each post.  Furthermore, some templates are
pulled in to generate the headers and footers of each page.  The templates are
written directly in HTML and really serve only to simplify each page with
otherwise largely duplicated content.
</p>
</div>
</div>
