blog/2019/03/static-site-generation/index.org
*** Summary Page Generation
:PROPERTIES:
:ID:       e3626070-bb51-4f0a-a4ff-35ad9a912a49
:END:

The summary page is a bit more involved to generate.  A few questions had to be
answered before it was possible: how to generate the summary text? And how
to sort and order posts?

To answer the first question, I dug into how [[hugo][Hugo]] was generating
these summaries.  It turns out, it really only takes the first couple hundred
characters and calls it the "summary".  This depends largely on the content of
each post to actually describe the post in the first couple hundred characters.
Obviously, this led to some awkward results, especially with links and section
headings mixed in.

To achieve similar results, it /would/ be fairly easy to write a script to
simply take the first few hundred characters after the preamble and output this
into something to be collected for the summary page.  However, a better
solution is available since we are taking full control over the generation
process.  Namely, we can put the preview content into a specific
[[org-mode][Org-mode]] block to be parsed out and used explicitly for this
purpose.  If the summary for a post is only a sentence or two, the summary
generation process won't then start reading extra text, if the summary requires
a little more detail, it won't be cut short by the arbitrary read limit.

To generate the preview content, the ~generate_post_preview.sh~ script is used:

#+BEGIN_SRC bash
#!/usr/bin/env bash
# Generate HTML post summary tags

ORGIN=${1}
PROJ_ROOT=$(git rev-parse --show-toplevel)

source ${PROJ_ROOT}/scripts/org-metadata.sh

echo "${LINKS}"
echo "${PREVIEW}"
#+END_SRC

The ~LINKS~ variable is included in this file because we are generating an
intermediate file for [[pandoc][Pandoc]] to generate the summary content.
Without the ~LINKS~, any links included in the preview section would be broken.

The second question actually turns out to be pretty easy in practice: we parse
the ~#+ DATE:~ line from the preamble and prepend it to the summary content.

From the ~org-metadata.sh~ script:

#+BEGIN_SRC bash file:org-metadata.sh
ORIGIN=${1}
DATE=$(awk -F': ' '/^#\+DATE:/ { printf "%s", $2}' ${ORGIN})
#+END_SRC

Then, from the ~generate_post_summary_html.sh~ script:

#+BEGIN_SRC bash file: generate_post_summary_html.sh
#!/usr/bin/env bash
# Generate HTML post summary tags

ORGIN=${1}
GENERATED_PREVIEW_FILE=${2}
PROJ_ROOT=$(git rev-parse --show-toplevel)

source ${PROJ_ROOT}/scripts/org-metadata.sh
DISPLAY_DATE=$(date -d ${DATE} +'%a %b %d, %Y')
SORT_DATE=$(date -d ${DATE} +'%Y	%m	%d	')
PREVIEW_CONTENT=$(cat ${GENERATED_PREVIEW_FILE} | pandoc -f org -t html)

echo -n "${SORT_DATE}"
echo -n '<article class="post"><header>'
echo -n "<h2><a href=\"${SLUG}\">${TITLE}</a></h2>"
echo -n "<div class=\"post-meta\">${DISPLAY_DATE}</div></header>"
echo -n "<blockquote>$(echo ${PREVIEW_CONTENT})</blockquote>"
echo -n '<ul class="tags"><li><i class="fa fa-tags"></i></li>'
echo -n "${TAGS}" | awk '{ printf "<li>%s</li>", $0}'
echo -n '</ul>'
echo -n '<footer>'
echo -n "<a href=\"${SLUG}\">Read More</a>"
echo -n "</footer>"
echo ""
#+END_SRC

Finally, this is all put together with the ~generate_index_html.sh~ script:

#+BEGIN_SRC bash
#!/usr/bin/env bash
# Generate index.html page

INPUT_FILES=${@}
PROJ_ROOT=$(git rev-parse --show-toplevel)
source ${PROJ_ROOT}/scripts/site-templates.sh

cat "${HTML_HEADER_FILE}"
echo "<body>"
cat "${HTML_SUB_HEADER_FILE}"
cat ${INPUT_FILES} | sort -r -n -k1 -k2 -k3 | awk -F'	' '{print $4}'
echo "</body>"
cat "${HTML_FOOTER_FILE}"
#+END_SRC

Specifically, the following line is of interest with respect to properly
sorting:

#+BEGIN_SRC bash
cat ${INPUT_FILES} | sort -r -n -k1 -k2 -k3 | awk -F'	' '{print $4}'
#+END_SRC

Use the tab-separated date fields from before, and use them to sort each of the
post summaries onto the ~index.html~ page.

*** RSS/XML Generation
:PROPERTIES:
:ID:       37caeae7-0cfd-46d6-ae93-961135f72d33
:END:

I also wanted to keep the RSS/XML feeds going.  However, as it turns out,
generating the RSS feed was achieved by performing essentially the same steps
used for generating the summary ~index.html~ page.

** Future Work
:PROPERTIES:
:ID:       7f7a054f-f45a-4a60-bafa-0dad37b81575
:END:

There is a fairly obvious limitation of the summary page generation, but only
really obvious if I write more content.  There was and is no current archive
page.  Moreover, _all_ posts are put into the ~index.html~ summary page.
If/when more posts are written and published, a solution for the first page
will be necessary.  However, this was necessary regardless of whether the blog
is generated using [[hugo][Hugo]] or generated via the new process.

