blog/2019/03/static-site-generation/index.html

<div id="outline-container-org8142fcf" class="outline-3">
<h3 id="org8142fcf">Summary Page Generation</h3>
<div class="outline-text-3" id="text-org8142fcf">
<p>
The summary page is a bit more involved to generate.  A few questions had to be
answered before it was possible: how to generate the summary text? And how
to sort and order posts?
</p>

<p>
To answer the first question, I dug into how <a href="https://gohugo.io/">Hugo</a> was generating
these summaries.  It turns out, it really only takes the first couple hundred
characters and calls it the "summary".  This depends largely on the content of
each post to actually describe the post in the first couple hundred characters.
Obviously, this led to some awkward results, especially with links and section
headings mixed in.
</p>

<p>
To achieve similar results, it <i>would</i> be fairly easy to write a script to
simply take the first few hundred characters after the preamble and output this
into something to be collected for the summary page.  However, a better
solution is available since we are taking full control over the generation
process.  Namely, we can put the preview content into a specific
<a href="https://org-mode.org">Org-mode</a> block to be parsed out and used explicitly for this
purpose.  If the summary for a post is only a sentence or two, the summary
generation process won't then start reading extra text, if the summary requires
a little more detail, it won't be cut short by the arbitrary read limit.
</p>

<p>
To generate the preview content, the <code>generate_post_preview.sh</code> script is used:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/</span><span style="font-weight: bold;">env</span><span style="font-weight: bold; font-style: italic;"> bash</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Generate HTML post summary tags</span>

<span style="font-weight: bold; font-style: italic;">ORGIN</span>=${<span style="font-weight: bold; font-style: italic;">1</span>}
<span style="font-weight: bold; font-style: italic;">PROJ_ROOT</span>=$(git rev-parse --show-toplevel)

source ${<span style="font-weight: bold; font-style: italic;">PROJ_ROOT</span>}/scripts/org-metadata.sh

<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${LINKS}"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"${PREVIEW}"</span>
</pre>
</div>

<p>
The <code>LINKS</code> variable is included in this file because we are generating an
intermediate file for <a href="https://pandoc.org">Pandoc</a> to generate the summary content.
Without the <code>LINKS</code>, any links included in the preview section would be broken.
</p>

<p>
The second question actually turns out to be pretty easy in practice: we parse
the <code>#+ DATE:</code> line from the preamble and prepend it to the summary content.
</p>

<p>
From the <code>org-metadata.sh</code> script:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">ORIGIN</span>=${<span style="font-weight: bold; font-style: italic;">1</span>}
<span style="font-weight: bold; font-style: italic;">DATE</span>=$(awk -F<span style="font-style: italic;">': '</span> <span style="font-style: italic;">'/^#\+DATE:/ { printf "%s", $2}'</span> ${<span style="font-weight: bold; font-style: italic;">ORGIN</span>})
</pre>
</div>

<p>
Then, from the <code>generate_post_summary_html.sh</code> script:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/</span><span style="font-weight: bold;">env</span><span style="font-weight: bold; font-style: italic;"> bash</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Generate HTML post summary tags</span>

<span style="font-weight: bold; font-style: italic;">ORGIN</span>=${<span style="font-weight: bold; font-style: italic;">1</span>}
<span style="font-weight: bold; font-style: italic;">GENERATED_PREVIEW_FILE</span>=${<span style="font-weight: bold; font-style: italic;">2</span>}
<span style="font-weight: bold; font-style: italic;">PROJ_ROOT</span>=$(git rev-parse --show-toplevel)

source ${<span style="font-weight: bold; font-style: italic;">PROJ_ROOT</span>}/scripts/org-metadata.sh
<span style="font-weight: bold; font-style: italic;">DISPLAY_DATE</span>=$(date -d ${<span style="font-weight: bold; font-style: italic;">DATE</span>} +<span style="font-style: italic;">'%a %b %d, %Y'</span>)
<span style="font-weight: bold; font-style: italic;">SORT_DATE</span>=$(date -d ${<span style="font-weight: bold; font-style: italic;">DATE</span>} +<span style="font-style: italic;">'%Y        %m      %d      '</span>)
<span style="font-weight: bold; font-style: italic;">PREVIEW_CONTENT</span>=$(cat ${<span style="font-weight: bold; font-style: italic;">GENERATED_PREVIEW_FILE</span>} | pandoc -f org -t html)

<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">"${SORT_DATE}"</span>
<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">'&lt;article class="post"&gt;&lt;header&gt;'</span>
<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">"&lt;h2&gt;&lt;a href=\"${SLUG}\"&gt;${TITLE}&lt;/a&gt;&lt;/h2&gt;"</span>
<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">"&lt;div class=\"post-meta\"&gt;${DISPLAY_DATE}&lt;/div&gt;&lt;/header&gt;"</span>
<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">"&lt;blockquote&gt;$(echo ${PREVIEW_CONTENT})&lt;/blockquote&gt;"</span>
<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">'&lt;ul class="tags"&gt;&lt;li&gt;&lt;i class="fa fa-tags"&gt;&lt;/i&gt;&lt;/li&gt;'</span>
<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">"${TAGS}"</span> | awk <span style="font-style: italic;">'{ printf "&lt;li&gt;%s&lt;/li&gt;", $0}'</span>
<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">'&lt;/ul&gt;'</span>
<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">'&lt;footer&gt;'</span>
<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">"&lt;a href=\"${SLUG}\"&gt;Read More&lt;/a&gt;"</span>
<span style="font-weight: bold;">echo</span> -n <span style="font-style: italic;">"&lt;/footer&gt;"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">""</span>
</pre>
</div>

<p>
Finally, this is all put together with the <code>generate_index_html.sh</code> script:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">!/usr/bin/</span><span style="font-weight: bold;">env</span><span style="font-weight: bold; font-style: italic;"> bash</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Generate index.html page</span>

<span style="font-weight: bold; font-style: italic;">INPUT_FILES</span>=${<span style="font-weight: bold; font-style: italic;">@</span>}
<span style="font-weight: bold; font-style: italic;">PROJ_ROOT</span>=$(git rev-parse --show-toplevel)
source ${<span style="font-weight: bold; font-style: italic;">PROJ_ROOT</span>}/scripts/site-templates.sh

cat <span style="font-style: italic;">"${HTML_HEADER_FILE}"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"&lt;body&gt;"</span>
cat <span style="font-style: italic;">"${HTML_SUB_HEADER_FILE}"</span>
cat ${<span style="font-weight: bold; font-style: italic;">INPUT_FILES</span>} | sort -r -n -k1 -k2 -k3 | awk -F<span style="font-style: italic;">'   '</span> <span style="font-style: italic;">'{print $4}'</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"&lt;/body&gt;"</span>
cat <span style="font-style: italic;">"${HTML_FOOTER_FILE}"</span>
</pre>
</div>

<p>
Specifically, the following line is of interest with respect to properly
sorting:
</p>

<div class="org-src-container">
<pre class="src src-bash">cat ${<span style="font-weight: bold; font-style: italic;">INPUT_FILES</span>} | sort -r -n -k1 -k2 -k3 | awk -F<span style="font-style: italic;">'   '</span> <span style="font-style: italic;">'{print $4}'</span>
</pre>
</div>

<p>
Use the tab-separated date fields from before, and use them to sort each of the
post summaries onto the <code>index.html</code> page.
</p>
</div>
</div>

<div id="outline-container-org94b58ce" class="outline-3">
<h3 id="org94b58ce">RSS/XML Generation</h3>
<div class="outline-text-3" id="text-org94b58ce">
<p>
I also wanted to keep the RSS/XML feeds going.  However, as it turns out,
generating the RSS feed was achieved by performing essentially the same steps
used for generating the summary <code>index.html</code> page.
</p>
</div>
</div>
</div>

<div id="outline-container-org52d9de0" class="outline-2">
<h2 id="org52d9de0">Future Work</h2>
<div class="outline-text-2" id="text-org52d9de0">
<p>
There is a fairly obvious limitation of the summary page generation, but only
really obvious if I write more content.  There was and is no current archive
page.  Moreover, <span class="underline">all</span> posts are put into the <code>index.html</code> summary page.
If/when more posts are written and published, a solution for the first page
will be necessary.  However, this was necessary regardless of whether the blog
is generated using <a href="https://gohugo.io/">Hugo</a> or generated via the new process.
</p>
</div>
</div>
