blog/2019/03/static-site-generation/index.org
** Parting Thoughts
:PROPERTIES:
:ID:       7fe3dfbc-f9c9-464a-b5ff-36ab965cf75e
:END:

Like many projects, this was started because I personally was dissatisfied with
the current state of options.  However, that said, I did not write these
scripts to be used directly for someone else.  I'm not sure I would necessarily
recommend this approach to someone else, unless, of course, they wanted to do
it to learn or to otherwise take control of their content.  That said, I hope
this captures the essence of the scripts, their major functions, and the
motivations behind them.  The scripts are available, WITHOUT WARRANTY, under
the [[gnu-gpl][GNU General Public License (version 3)]].

If you have questions or comments, feel free to reach out to me.
