blog/2019/03/static-site-generation/index.html

<div id="outline-container-org0b51d3c" class="outline-2">
<h2 id="org0b51d3c">Parting Thoughts</h2>
<div class="outline-text-2" id="text-org0b51d3c">
<p>
Like many projects, this was started because I personally was dissatisfied with
the current state of options.  However, that said, I did not write these
scripts to be used directly for someone else.  I'm not sure I would necessarily
recommend this approach to someone else, unless, of course, they wanted to do
it to learn or to otherwise take control of their content.  That said, I hope
this captures the essence of the scripts, their major functions, and the
motivations behind them.  The scripts are available, WITHOUT WARRANTY, under
the <a href="https://www.gnu.org/licenses/gpl-3.0.html">GNU General Public License (version 3)</a>.
</p>

<p>
If you have questions or comments, feel free to reach out to me.
</p>
</div>
</div>
</div>
<footer id="" class="status">
<footer>
  <p>&copy; 2014-2025 Kenny Ballou.
    <a href="http://creativecommons.org/licenses/by-nc-sa/4.0/">Some rights
      reserved.</a></p>
  <p>Powered by <a href="https://gnu.org">GNU/Linux</a></p>
</footer>
</footer>
</body>
</html>
